# OLDFindAttachHangPos

## Description
Searches for a Hanging Position for the Hang Points of the given load index. Returns the Position handle if found, NIL otherwise.

```pascal
FUNCTION OLDFindAttachHangPos(
				handle    : HANDLE;
				loadIndex : INTEGER): HANDLE;
```

```python
def vs.OLDFindAttachHangPos(handle, loadIndex):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|handle|HANDLE|   |
|loadIndex|INTEGER|   |

## Version
Availability: from Vectorworks 2018

## Category
* Truss Analysis